# Order Prediction - EDA


## Conclusions
- Can have more than one order per day
- In the *missing_order_days* file, there is some users without missing **transaction_amount** and **order_date**
- There isnt partially missing null for **transaction_amount** and **order_date**
- NAN only occurs one time per id on missing file

# Imports

In [1]:
import pandas as pd

# Parameters

# Definitions

In [18]:
def find_users_with_partial_null(df, user_column, target_column):
    # Group by user_id
    grouped = df.groupby(user_column)

    for user_id, group in grouped:
        # Check if there are both NaN and non-NaN values in the target column
        if group[target_column].isnull().any() and group[target_column].notnull().any():
            return group  # Return the first group that satisfies the condition

# Explore

In [9]:
historical = pd.read_parquet("../datasets/historical_orders.parquet")
missing_orders = pd.read_parquet("../datasets/august_with_missing_order_days.parquet")
total_sales = pd.read_parquet("../datasets/august_total_sales.parquet")

In [8]:
historical.head(10)

          account_id  order_date  transaction_amount
0  BR_09607801000194  2021-08-28            11011.20
1  BR_09607801000194  2021-08-28            13764.00
2  BR_09607801000194  2021-08-28            11011.20
3  BR_09607801000194  2021-08-28            11011.20
4  BR_09607801000194  2021-08-28            13764.00
5  BR_09607801000194  2021-08-28            13764.00
6     BR_00481601562  2022-06-18             1017.00
7     BR_00481601562  2022-06-18              244.20
8     BR_00481601562  2022-06-18               23.00
9     BR_00481601562  2022-06-18               42.92

In [7]:
missing_orders.head(10)

       account_id  order_date  transaction_amount
0  BR_09532176632  2022-08-03               11.16
1  BR_09532176632  2022-08-03               32.52
2  BR_09532176632  2022-08-03               24.90
3  BR_09532176632  2022-08-03               28.50
4  BR_09532176632  2022-08-03               11.16
5  BR_09532176632  2022-08-03               11.16
6  BR_09532176632  2022-08-03               11.16
7  BR_09532176632  2022-08-03               24.90
8  BR_09532176632  2022-08-04               65.90
9  BR_09532176632  2022-08-04               65.90

In [10]:
total_sales.head(10)

          account_id  total_transaction_amount_august
0     BR_00000343803                           309.99
1     BR_00001415930                           874.98
2     BR_00001760106                         11976.70
3     BR_00002485176                           511.48
4     BR_00002536340                          7081.14
5     BR_00003056503                           105.36
6     BR_00003686108                           137.18
7     BR_00005396352                         21205.47
8     BR_00009144366                          1711.22
9  BR_00012291000138                           212.60

In [12]:
missing_orders[missing_orders["transaction_amount"].isna()].head(10)

            account_id order_date  transaction_amount
76   BR_66209644000100       None                 NaN
113     BR_04185749287       None                 NaN
114     BR_21110581220       None                 NaN
126  BR_10296303000157       None                 NaN
127  BR_06863137000156       None                 NaN
256     BR_23982071615       None                 NaN
435     BR_96388820344       None                 NaN
439  BR_39599024000144       None                 NaN
483     BR_06320579390       None                 NaN
484     BR_17128960678       None                 NaN

In [36]:
missing_orders[missing_orders["account_id"] == "BR_66209644000100"]

           account_id order_date  transaction_amount
76  BR_66209644000100       None                 NaN

In [32]:
# More than one order in a day?

In [14]:
missing_orders["account_id"].value_counts().nlargest(10)

account_id
BR_14517343000132    343
BR_37136488000199    296
BR_69300631268       290
BR_38438376000155    288
BR_10459684000148    259
BR_30179280000108    249
BR_36662317000130    229
BR_17481882000157    210
BR_35669961000178    196
BR_49019136000302    195
BR_39365048000139    195
BR_71530975115       194
BR_36924114000175    186
BR_15356879679       186
BR_87760419000120    183
BR_33444366000109    183
BR_37887177000161    183
BR_63576910204       179
BR_33821457000116    179
BR_11315152000108    178
Name: count, dtype: int64

In [17]:
missing_orders[missing_orders["account_id"] == "BR_14517343000132"].to_csv("../datasets/BR_14517343000132.csv",index=None)

In [19]:
# Is there user with partially null on order_date or transaction amount?

In [28]:
result = find_users_with_partial_null(missing_orders, 'account_id', 'order_date')

In [29]:
if result:
    print(result)

In [30]:
result = find_users_with_partial_null(missing_orders, 'account_id', 'transaction_amount')

In [31]:
if result:
    print(result)

In [37]:
# Every nan only occurs one time?

In [38]:
missing_orders[missing_orders["transaction_amount"].isna()]["account_id"].value_counts().nlargest(10)

account_id
BR_66209644000100    1
BR_81428359400       1
BR_53524195334       1
BR_31226313000196    1
BR_18778783755       1
BR_03256996400       1
BR_01189928485       1
BR_28653131000197    1
BR_08044981000180    1
BR_03703808608       1
Name: count, dtype: int64